% Просто считаем результат для выбранной последовательности
clear;
tstep = 1e-14; % Шаг для расчёта НУШ

% Параметры кубита
w01 = 5.1*2*pi*1e9; % Частота 0-1
w12 = w01 - 0.25*2*pi*1e9; % Частота 1-2

% Параметры операции
wt = 25*2*pi*1e9; % Тактовая частота
w = 4*1e-12; % Длительность импульса
T = 2*pi/wt; % Период м/д импульсами
Theta = 0.024; % Угол поворота (до оптимизации)
Sequence = [0,1,1,1,-1,0,1,1,1,-1,-1,-1,1,1,-1,-1,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,-1,-1,0,1,1,1,-1,0,1,1,-1,-1,0,1,1,-1,-1,1,1,-1,-1,-1,0,1,1,-1,1,0,1,-1,-1,-1,0,1,-1,-1,-1];
CellsNumber = length(Sequence);
Len = 3e-8;
F = Fidelity(w01, w12, w, T, Len, tstep, Sequence, Theta);
disp(['F = ',num2str(F)]);
